Tekla.Structures.Drawing.Part.Representation
The part representations.

Tekla.Structures.Drawing.Part.Representation.Outline
The outline representation.

Tekla.Structures.Drawing.Part.Representation.Symbol
The symbol representation.

Tekla.Structures.Drawing.Part.Representation.WorkshopForm
The workshop form representation.

Tekla.Structures.Drawing.Part.Representation.Exact
The exact representation.

Tekla.Structures.Drawing.Part.Representation.BoundingBox
The bounding box representation.

Tekla.Structures.Drawing.Part.Representation.BaseBox
The base box representation.

Tekla.Structures.Drawing.Part.Representation.SolidWithPartialProfile
The solid with partial profile representation.